[
    {
      "content" : "2) Supply the right tense or form of the bracketed words. (3 marks)   Cigarette smoking is the leading cause of (prevent) _____________ death in the United   States. It causes more than 480,000 deaths each year in the United States. This is nearly one in   five deaths. Smoking causes more deaths each year than Human Immunodeficiency Virus (HIV), illegal drug use, alcohol use, motor vehicle injuries, and firearm-related incidents combined. In fact, since 1920, more than 10 times as many U.S. citizens (die) _____________ prematurely from cigarette smoking than in all the wars fought by the United States. Moreover, breathing in secondhand smoke, also (know) _____________ as passive smoking, increases your risk of getting the same health conditions as (smoke) _____________. For example, if you have never smoked but you have a spouse who smokes, your risk of developing lung cancer   increases by about a quarter. Babies and children are (particular) _____________ vulnerable   to the effects of secondhand smoke. A child who is exposed to passive smoke is at increased   risk of developing chest infections, meningitis, a persistent cough and, if they have asthma,   their symptoms (get) _____________ worse. They are also at increased risk of cot death and   an ear infection called glue ear.   2- Fill in each gap with one word from the list below. There are two extra words. (3 marks)   While/ disposes/ endured/ accumulates/ worse/ acutely/ because/ wasteful   New York City _____________ another brutal summer this year, and you know what   that means: a severe urban heat island effect and the omnipresent stench of rotting garbage.   Summer in New York makes one _____________ aware of the near-constant presence of waste   piling up on pavements waiting to be collected and trucked to an out-of-state landfill. New York   is, in fact, widely reported to be the world’s most _____________ city. This means New York   uses the most energy (“the equivalent of one oil supertanker every 1.5 days”), _____________   of the most trash (33m tons per year), and uses the most water. The dubious title comes from a   study published last spring in Proceedings of the National Academy of Sciences (PNAS).   _____________ the world’s most wasteful city could well be in the consumption-rich US, New   York is an unlikely culprit. If the world’s most wasteful city is American, as it very well may   be, it is probably a sprawling sunbelt metropolis like Houston, Atlanta, Tampa, or Phoenix –   all of which rate _____________ than New York on most environmental metrics but were not   included in that particular study."
    },
    {
      "content" : "2) Supply the right tense or form of the bracketed words. (3 marks)   Obesity is one of the most pressing public health issues of the 21st century. It (1) (affect) _____________ people of all ages and socioeconomic backgrounds. Over the past few decades, the global obesity rate (2) (rise) _____________ dramatically, especially in urban areas. Poor dietary choices, limited physical activity, and increased screen time (3) (contribute) _____________ to the prevalence of this condition. In many cases, obesity (4) (link) _____________ to serious diseases such as diabetes, heart disease, and certain cancers. Health professionals (5) (urge) _____________ governments to implement preventive strategies, such as public education campaigns and the regulation of unhealthy food advertising. If immediate action is not taken, obesity-related illnesses (6) (continue) _____________ to burden healthcare systems worldwide."
    },
    {
      "content" : "2) Supply the right tense or form of the bracketed words. (3 marks)   Climate change is a growing threat that (1) (impact) _____________ nearly every aspect of life on Earth. Scientists across the globe (2) (warn) _____________ for decades about the consequences of rising temperatures and shifting weather patterns. In recent years, severe droughts and floods (3) (become) _____________ more frequent, posing serious risks to food security and public health. Although global agreements such as the Paris Accord (4) (aim) _____________ to reduce emissions, many countries still (5) (struggle) _____________ to meet their targets due to economic and political pressures. If meaningful action is delayed further, the effects of climate change (6) (intensify) _____________ rapidly, placing future generations in jeopardy."
    },
    {
      "content" : "2) Supply the right tense or form of the bracketed words. (3 marks)   In today’s digital era, misinformation (1) (spread) _____________ rapidly through social media platforms, often before it can be verified by reliable sources. Many users (2) (share) _____________ content impulsively, without checking its accuracy or origin. As a result, false narratives (3) (circulate) _____________ widely, influencing public opinion and sometimes undermining democratic processes. While fact-checking initiatives have been introduced, they often (4) (fail) _____________ to keep pace with the volume of information being generated. Experts argue that media literacy programs in schools (5) (need) _____________ to be prioritized in order to equip students with critical thinking skills. If proactive steps are not taken, the erosion of public trust in information sources (6) (continue) _____________ to grow."
    },
    {
      "content" : "2) Supply the right tense or form of the bracketed words. (3 marks)   Artificial intelligence (AI) (1) (emerge) _____________ as a transformative force across multiple industries, from healthcare to transportation. Advanced algorithms now (2) (analyze) _____________ vast amounts of data more efficiently than humans, enabling faster decision-making and predictive capabilities. However, as AI tools (3) (integrate) _____________ into daily operations, concerns about ethics, bias, and privacy (4) (intensify) _____________. Policymakers and developers alike must (5) (collaborate) _____________ to establish clear guidelines that ensure responsible innovation. Without appropriate oversight, the long-term impact of AI (6) (remain) _____________ uncertain, especially in sectors that directly affect human lives. "
    }
]
