[
  {
    "content": "1- Fill in the blanks with the right words from the list. There are two extra ones.(3 marks)  Moreover/ non-traditional/ making/ accomplishments/ deeply/ conventional/  Consequently/ deeper  The definition of success is undergoing a profound transformation in contemporary society, moving away from ______________ measures of wealth and status towards a more  holistic and nuanced understanding. While financial prosperity and professional ______________ remain important benchmarks for many, there is a growing recognition of the  value of personal fulfillment, well-being, and social impact. Success is increasingly being  redefined to encompass a sense of purpose, meaningful relationships, and overall life  satisfaction. ______________, the rise of digital connectivity and social media has reshaped  perceptions of success, with individuals showcasing diverse paths and achievements beyond  traditional career trajectories. This shift reflects a ______________ societal questioning of  materialism and the pursuit of external validation, with emphasis placed on authenticity,  resilience, and inner growth. ______________, individuals are embracing a more  individualized and multifaceted approach to success, one that prioritizes personal growth,  fulfillment, and ______________ a positive difference in the world.",
    "category" : "Creative, inventive minds"
  },
  {
    "content": "1) Fill in the blanks with the words from the following box (there are two extra words)(3 marks) :  Less skilled/ by/ immigration/ illegal/ opportunity/ competition/ immigrated/ for  The concern over __________________ is fuelled in part by two conflicting fears. __________________  immigrants are vulnerable to exploitation __________________ employers and often victimized  kidnapped, tortured and sometimes killed by criminals and smugglers. At the other extreme , in  cities like los Angeles, they flood labor market and set off bitter __________________ with American  workers and legal immigrants for jobs. Much as Americans tend to regard immigrants as poor,  uneducated and __________________, the vast majority are surely enterprising. What they seek is  ___________________. The opportunity to hold jobs that no American wants, to buy a T.V. set and a car, to  start a new family and invest in the next generation.",
    "category" : "Life issues"
  },
  {
    "content": "1- Fill in the blanks with the right words from the list. There are two extra ones.(3 marks) frequently/ artificially/ neurological/ into/ analyzing/ limited/ toward/ accuracy Scientists may soon be able to interpret what someone is saying simply by ___________  their brainwaves as they speak. This revolutionary progress in neuroscience would help millions  of people who suffer from communication problems and _______________ disorders. The  scientists developed a form of artificial intelligence that can decode brainwaves and translate  them into text. Algorithms take the brain activity created as a person speaks and translate it in  real time _________ sentences on a screen. The scientists are from the University of California,  San Francisco. They say their algorithms have a 97 per cent translation ____________ rate but  are working hard to improve on this. The scientists say they are at the early stages of being able  to machine-translate everything someone says. The software used in their experiments matched  features of speech that were repeated ____________ to parts and shapes of the mouth. These  included elements of English speech such as vowels, consonants, and commands. The  experiments were ___________ to around 40 short and simply constructed spoken sentences.",
    "category" : "Creative, inventive minds"
  },
  {
    "content": "1. Fill in the blanks with words from the box. There are 2 extra ones. (3 marks)  Despite / disaster/ promptly/ to/ However/ chronically/ from/ Additionally  Following the earthquake in Japan, doctors assert that Twitter is proving to be an effective tool  for communicating with chronically ill patients. In correspondence submitted to The Lancet,  Japanese medical professionals emphasize the crucial role of social networking sites in directing  patients to obtain necessary medication. Despite disruptions to telephone networks post-  earthquake, internet connectivity remained reliable. However, the need for Japan to bolster its  primary healthcare system is underscored. These insights, shared in letters featured in The  Lancet's Correspondence section, originate from doctors across Japan reflecting on the  healthcare ramifications of the March earthquake and tsunami. Drs. Yuichi Tamura and Keiichi  Kukuda highlight the challenges in establishing a drug supply chain immediately after the  disaster and emphasize the utility of social networking platforms. By utilizing features like  Twitter's retweet function, rapid dissemination of information was achieved, enabling displaced  patients to locate essential medications promptly via Twitter or Facebook notifications. This  method facilitated widespread access to vital treatments among affected individuals.",
    "category" : "Life issues"
  },
  {
    "content": "1. Fill in the blanks with words from the box. (3 marks)  Booking – and – about – largest – began – trip – throughout – hotels  The first organized tours dated back to 1842 when the company ‘Thomas  Cook’ chartered a train to take a group of campaigners from Leicester to  South Borough. This company grew to become one of the …………………  and most well-known travel agencies. With the gradual decline of visits to  British seaside resorts after the Second World War, Thomas Cook …………  promoting foreign holidays in the early 1950s. Leaflets __________ these holidays were shown at town halls ……………………… Britain.  However, they decided not to go ………………..……… the new form of  cheap holidays combining transport ……………………… accommodation  arrangement into a single package.",
    "category" : "Art shows and holidaying"
  },
  {
    "content": "1- Fill in the blanks with the right words from the list. There are two extra ones.  (3 marks)  river/ leap/ land/ surrounded/ climbed/ camping/ stunning/ touring  A couple of years ago, my boyfriend and I set our sights on a place called Florac, so  one day we decided to go __________ there. It was the most incredible drive I have ever  had. Cruising down steep slopes, at times with the van’s door wide open, and taking in the  most __________ views of mountains and valleys, I felt a tingly sensation. I believe it was  freedom. Florac is a beautiful little French town in the middle of the Cévennes, ___________  by natural wonders. Our camping spot was along the Tarn River, right outside of quaint  Florac. After taking a nice dip in the __________, we walked along the bank until we reached  a rocky area with small cliffs jutting into the water. We __________ on top, and I remember  my boyfriend daring me to jump into the river. It might have been 5 meters high (not the most  awe-inspiring drop, but it was still scary!). I thought about it for about 3 seconds. “Yes, I’m  doing this!”, I heard myself saying. I started running and, reaching the edge, I took a  ___________ of faith into the cool water below. At that very moment, I felt like a different  version of me was freed.",
    "category" : "Art shows and holidaying"
  },
  {
    "content": "1. Fill in the blanks with the words from the following box (there are two extra words) (3.5 marks):  Rewarding/ moral/ ethical/ lifetime/ punish/ consequences/ discouraging/ habit/ immoral  As a parent, if you wish that your kids should learn __________, moral values, you should first practice  them on yourself. They imitate you and copy your habits. They love to act like you. So, if your child sees  you lying, he won’t consider lying as a bad __________. If he sees his parents cheating, he will develop  the habit of cheating for his __________. So, the ideal practice to teach your child is by adopting these  __________ values and ethics yourself. Enforce your values by __________ good behavior (usually, praise  is enough) and __________ all instances of bad behavior by fair, consistent __________.",
    "category" : "Life issues"},
  {
    "content": "1- Fill in the blanks with the right words from the list. There are two extra ones.(3 marks)  increase/ global/ migrant/ challenges/ Despite/ drop/ Although/ taking  If you have ever thought about working in another country, you could easily become a  ____________ laborer. Youth between 15 and 30 years of age already represent a large share  of the migrant population. _______________ this, young people remain largely invisible in  policy development. A myriad of push and pull factors attract more and more young people to  work and live abroad, especially in developed countries, aiming at improving their standards of  living. That is why it is important to learn more about the ______________ effects of migrant  labor so that people can work together to ______________ the opportunities it presents and  effectively manage the ______________ it can create. Youth are the leaders, parents, educators,  and workers of tomorrow. By learning more about the issues and _______________ action  today, one can ensure a better future for him/herself.",
    "category" : "Education matters"
  },
  {
    "content": "1- Fill in the blanks with the right words from the list. There are twoextra ones. (3 marks)  faster/ learning/ millennials/ workforce/ identified/ pace/ staying/ heartening  We can all become obsolete. In itself this is nothing new, but the fast  _______________ of recent changes means we can now become obsolete  _______________ than ever before. This is a risk not only for us personally, but it is  also a risk for organizations if the skills and knowledge of their _______________  becomes obsolete. The key to _______________ relevant and valuable is continuous  or lifelong learning. A Pew Research study found that 81% of 18-29-year olds in the  United States _______________ themselves as lifelong learners. It has been argued  that _______________ are prioritizing happiness and learning because they  understand the link between the two. As this younger cohort moves through the  workforce, we might expect greater demands for continuous learning opportunities.  This is _______________ to see, but also presents a challenge to organizations that  do not promote a culture of continuous learning or are limited to fixed courses or  resources.",
    "category" : "Education matters"},
  {
    "content": "1. Fill in the blanks with 6 words from the box below. (3 marks)  of / symtoms / exposure / becoming / those / arise / appears / for  Deciding that you are now ready to quit smoking is only half the battle.  Knowing where to start on your path to n_______________ smoke-free can help  you to take the leap. Quitting smoking can be tough but not impossible.  There are some effective ways _______________ smokers to stop smoking  today. Tobacco use and _______________ to second-hand smoke are responsible for more than 480,000 deaths each year in the United States,  according to the America Lung Association. Most people are aware of the  numerous health risks that _______________ from cigarette smoking, and yet  tobacco use is still the leading cause of preventable death and disease in the  U.S. By quitting smoking, you will improve your health and the quality and  duration of your life, as well as the lives of _______________ around you. To  quit smoking, you not only need to alter your behaviour and cope with the  withdrawal _______________ experienced from cutting out nicotine, but you  also need to find other ways to manage your moods.  ",
    "category" : "Life issues"
  },
  {
    "content": "1- Fill in the blanks with the right words from the list. There are two extra ones.  (3 marks)  Marked/ throughout/ outside/ archipelago/ conveniently/ neglected/ inside/ barefoot  Kurumba was the very first private island resort in the Maldives when it opened its doors in  1972 in the Indian Ocean _______________ of the Maldives. Opened by four young  Maldivians on an uninhabited coconut plantation island in October 1972, Kurumba  ___________ the beginning of the tourism industry in the country. At that time, the Maldives was isolated with no contact with the ___________ world except by ham radio, no telephones,  main electricity or water, few vehicles, no paved roads, and only a small airstrip built by  volunteers. Kurumba began with 30 huts built of coral and thatched with coconut leaves. The  first guests were ___________ backpackers in search of sand, sea, and sun. About 1,000 tourists  visited the island in 1972; now, it is over 1.5 million tourists, staying in over 140 resorts _____________ the Maldives. Kurumba Maldives is set on a tropical island in the North Male’  Atoll, _____________ situated a brief 10-minute speedboat ride from the airport. It draws on  its proud history, charismatic settings, and heartfelt service to offer compelling and diverse  experiences amidst a stunning island.",
    "category" : "Education matters"
  },
  {
    "content": "1- Fill in the blanks with the right words from the list. There are two extra ones.  (3 marks)  into/ conceived/ diversity/ inclusion/ reserving/ discrimination/ to/ workplace  Texaco Inc’s efforts against race and sex ______________, spurred by a landmark lawsuit,  have been “well _____________, well designed, and comprehensive”, the chairman of a court-  imposed committee said yesterday. Deval Patrick, the Boston lawyer who is chairman of the  committee, said it was ________________ judgment on the effectiveness of Texaco’s programs “simply because they have not been in place long enough.” Texaco pledged to make its  managers more sensitive and its minority employees more comfortable in the  _______________ and to involve more minorities in its spending and investment. The  committee is to help Texaco put such practices _______________ effect. “The hiring and  promotion of qualified minorities and women over the last year have shown a remarkable  improvement”, Mr. Patrick said, and Texaco is creating “an inclusive work environment where  workforce ________________ is viewed as a competitive business advantage.”",
    "category" : "Life issues"
  }
  ]