[
  {
    "content": "2) Write an article for your school magazine discussing the long-term health consequences of poor nutrition and the benefits of adopting a balanced diet rich in fruits, vegetables, and whole grains. Include suggestions for students to improve their eating habits and lead a healthier lifestyle. (8 marks)",
    "category": "Life issues"
  },
  {
    "content": "2) Write an article for your school magazine warning teenagers about the dangers of smoking. Discuss its harmful effects on physical health, how it leads to addiction, and suggest healthy alternatives to manage stress or peer pressure. (8 marks)",
    "category": "Life issues"
  },
  {
    "content": "2) Write a report on the impact of climate change on everyday life. Mention the causes such as pollution and deforestation, highlight extreme weather events, and suggest actions students can take to reduce their carbon footprint. (8 marks)",
    "category": "Life issues"
  },
  {
    "content": "2) Write an article discussing the dangers of excessive screen time on mental and physical health. Include its effects on sleep, focus, and physical activity, and suggest ways students can develop healthier screen habits. (8 marks)",
    "category": "Life issues"
  },
  {
    "content": "2) Write a letter to your local community center suggesting the launch of a recycling program. Explain the problem of waste accumulation, the environmental benefits of recycling, and propose steps for successful implementation. (8 marks)",
    "category": "Life issues"
  },
  {
    "content": "2) Write a short essay about the importance of mental health awareness among teenagers. Discuss common issues like stress and anxiety, break the stigma around mental health, and suggest coping strategies or support systems available at school. (8 marks)",
    "category": "Life issues"
  },
  {
    "content": "2) Write a paragraph about road safety awareness campaigns for teenagers. Mention the dangers of careless driving, the importance of wearing seat belts and helmets, and how schools can educate students to stay safe. (8 marks)",
    "category": "Life issues"
  },
  {
    "content": "2) Write a speech to present at a cultural club meeting, arguing the importance of using holidays to explore different cultures and traditions rather than just relaxing or shopping. Share personal experiences or examples that highlight how cultural immersion during holidays can broaden one's perspective. (8 marks)",
    "category": "Art shows and holidaying"
  },
  {
    "content": "2) Write a detailed letter to your school principal proposing a new course or program that focuses on life skills such as communication, financial literacy, or critical thinking. Explain why such a course is necessary in today's world and how it could benefit students. (8 marks)",
    "category": "Education matters"
  },
  {
    "content": "2) Write a short article for your school newsletter about the importance of education in shaping a better future. Highlight how it opens job opportunities, promotes critical thinking, and contributes to personal and social development. (8 marks)",
    "category": "Education matters"
  },
  {
    "content": "2) Write an opinion paragraph about the rise of e-learning and its effects on students. Discuss the benefits of flexibility and access to resources, but also mention the challenges like lack of motivation or internet issues. (8 marks)",
    "category": "Education matters"
  },
  {
    "content": "2) Write a paragraph discussing the negative consequences of dropping out of school. Include the impact on career choices, personal growth, and social stability, and suggest ways to keep students engaged. (8 marks)",
    "category": "Education matters"
  },
  {
    "content": "2) Write an article promoting lifelong learning. Explain why continuing to learn new skills throughout life is essential in today’s changing world and suggest practical ways young people can stay curious and informed. (8 marks)",
    "category": "Education matters"
  },
  {
    "content": "2) Write a report about how school clubs and extracurricular activities support academic success. Include their role in improving teamwork, time management, and boosting student confidence. (8 marks)",
    "category": "Education matters"
  },
  {
    "content": "2) Write a paragraph about the digital divide in education. Explain how lack of access to devices or the internet affects learning, especially during online schooling, and propose simple solutions to bridge the gap. (8 marks)",
    "category": "Education matters"
  }
]
  